# CONTENTS

- IMPORTING DATA
- EXPLORING DATA
- COMBINING DATA
- EXPORTING DATA

# IMPORTING DATA

In [1]:
# import libraries
import pandas as pd
import numpy as np
import os

In [2]:
# initialize path variable
path = r'/Users/smac_/Documents/Courses/CF Data Analytics Program/Data Immersion/Achievement 4/05-2023 Instacart Basket Analysis'

In [3]:
# import data
df_ords = pd.read_csv(os.path.join(path, '02 Data', 'Prepared Data', 'b_orders_checked.csv'))
df_ords_prior = pd.read_csv(os.path.join(path, '02 Data', 'Original Data', 'orders_products_prior.csv'))

# EXPLORING DATA

## `'df_ords'` DATAFRAME

In [4]:
# column names & data types
df_ords.dtypes

order_id                    int64
user_id                     int64
order_number                int64
orders_day_of_week          int64
order_hour_of_day           int64
days_since_prior_order    float64
dtype: object

In [5]:
# first 5 rows
df_ords.head()

,order_id,user_id,order_number,orders_day_of_week,order_hour_of_day,days_since_prior_order
0,2539329,1,1,2,8,NaN
1,2398795,1,2,3,7,15.0
2,473747,1,3,3,12,21.0
3,2254736,1,4,4,7,29.0
4,431534,1,5,4,15,28.0

In [6]:
# last 5 rows
df_ords.tail()

,order_id,user_id,order_number,orders_day_of_week,order_hour_of_day,days_since_prior_order
3421078,2266710,206209,10,5,18,29.0
3421079,1854736,206209,11,4,10,30.0
3421080,626363,206209,12,1,12,18.0
3421081,2977660,206209,13,1,12,7.0
3421082,272231,206209,14,6,14,30.0

In [7]:
# dataframe size
df_ords.shape

(3421083, 6)

In [8]:
# cast nominal columns as string
df_ords['order_id'] = df_ords['order_id'].astype(str)
df_ords['user_id'] = df_ords['user_id'].astype(str)

In [9]:
# summary stats
df_ords.describe()

,order_number,orders_day_of_week,order_hour_of_day,days_since_prior_order
count,3.421083e+06,3.421083e+06,3.421083e+06,3.214874e+06
mean,1.715486e+01,2.776219e+00,1.345202e+01,1.111484e+01
std,1.773316e+01,2.046829e+00,4.226088e+00,9.206737e+00
min,1.000000e+00,0.000000e+00,0.000000e+00,0.000000e+00
25%,5.000000e+00,1.000000e+00,1.000000e+01,4.000000e+00
50%,1.100000e+01,3.000000e+00,1.300000e+01,7.000000e+00
75%,2.300000e+01,5.000000e+00,1.600000e+01,1.500000e+01
max,1.000000e+02,6.000000e+00,2.300000e+01,3.000000e+01

## `'df_ords_prior'` DATAFRAME

In [10]:
# column names & data types
df_ords_prior.dtypes

order_id             int64
product_id           int64
add_to_cart_order    int64
reordered            int64
dtype: object

In [11]:
# first 5 rows
df_ords_prior.head()

   order_id  product_id  add_to_cart_order  reordered
0         2       33120                  1          1
1         2       28985                  2          1
2         2        9327                  3          0
3         2       45918                  4          1
4         2       30035                  5          0

In [12]:
# last 5 rows
df_ords_prior.tail()

          order_id  product_id  add_to_cart_order  reordered
32434484   3421083       39678                  6          1
32434485   3421083       11352                  7          0
32434486   3421083        4600                  8          0
32434487   3421083       24852                  9          1
32434488   3421083        5020                 10          1

In [13]:
# dataframe size
df_ords_prior.shape

(32434489, 4)

In [14]:
# cast nominal columns as string
df_ords_prior['order_id'] = df_ords_prior['order_id'].astype(str)
df_ords_prior['product_id'] = df_ords_prior['product_id'].astype(str)
df_ords_prior['reordered'] = df_ords_prior['reordered'].astype(str)

In [15]:
# summary stats
df_ords_prior.describe()

       add_to_cart_order
count       3.243449e+07
mean        8.351076e+00
std         7.126671e+00
min         1.000000e+00
25%         3.000000e+00
50%         6.000000e+00
75%         1.100000e+01
max         1.450000e+02

# COMBINING DATA

In [16]:
# merge 'df_ords' & 'df_ords_prior' dataframes on 'order_id' (matching records only)
df_orders_products_combined = df_ords.merge(df_ords_prior, on = 'order_id', indicator = '_merge_prods_ords')

In [17]:
# merge flag frequency counts
df_orders_products_combined['_merge_prods_ords'].value_counts()

both          32434489
left_only            0
right_only           0
Name: _merge_prods_ords, dtype: int64

In [18]:
# first 5 rows in 'df_merged_large' dataframe
df_orders_products_combined.head()

,order_id,user_id,order_number,orders_day_of_week,order_hour_of_day,days_since_prior_order,product_id,add_to_cart_order,reordered,_merge_prods_ords
0,2539329,1,1,2,8,NaN,196,1,0,both
1,2539329,1,1,2,8,NaN,14084,2,0,both
2,2539329,1,1,2,8,NaN,12427,3,0,both
3,2539329,1,1,2,8,NaN,26088,4,0,both
4,2539329,1,1,2,8,NaN,26405,5,0,both

In [19]:
# 'df_merged_large' dataframe size
df_orders_products_combined.shape

(32434489, 10)

# EXPORTING DATA

In [ ]:
# export 'df_orders_products_combined' dataframe as pickle
df_orders_products_combined.to_pickle(os.path.join(path, '02 Data', 'Prepared Data', 'c_orders_products_combined.pkl'))